// Написать программу вычисления значения функции y = f(a)
int a = 4;
Console.Write(a);
