// Вывести квадрат числа
Console.WriteLine("Введите любое целое число");
int numberA = int.Parse(Console.ReadLine());
int result = numberA * numberA;
Console.WriteLine($"Квадратом числа {numberA} является {result}");